app/controllers/users_controller.rb

  def fb_connect
      fb_info = MiniFB.parse_cookie_information('209106392449144', cookies) # some users may have to use their API rather than the app. ID.
      @fb_app_id = '209106392449144';
      @fb_uid = fb_info['uid']
      @global_score = User.total_book_score
      if MiniFB.verify_cookie_signature('209106392449144', "fc6cfb76f24a937d5ab6161e468b24af", cookies)
        @user = User.where(['fb_id LIKE ?', @fb_uid]).all
        if @user.any?
          @user = @user.first
        else
          @user = User.create!(:fb_id => @fb_uid)
---
SELECT `users`.* FROM `users` WHERE (`users`.`fb_id` = 522091142) LIMIT 1
SELECT COUNT(*) FROM `users` WHERE (fb_id LIKE '522091142') LIMIT 1
INSERT INTO `users` (`updated_at`, `created_at`, `fb_id`, `book_count`, `friend_count`) VALUES ('2011-03-26 10:42:27', '2011-03-26 10:42:27', '522091142', 0, 0)

  def update
    @user = User.find(params[:id])
    @user.update_attributes!(params[:user])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `friend_count` = 225, `book_count` = 142, `updated_at` = '2011-03-25 23:57:54' WHERE (`users`.`id` = 1)